read_verilog -sv rtl/M00/src/M00_SystolicArray.sv
hierarchy -check -top M00_SystolicArray
synth -top M00_SystolicArray -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M00_SystolicArray_20260518_220045.v
stat
