read_verilog -sv rtl/M01/src/M01_DataflowController.sv
hierarchy -check -top M01_DataflowController
synth -top M01_DataflowController -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M01_DataflowController_20260518_220045.v
stat
