read_verilog -sv rtl/M02/src/M02_SRAMScratchpad.sv
hierarchy -check -top M02_SRAMScratchpad
synth -top M02_SRAMScratchpad -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M02_SRAMScratchpad_20260518_220045.v
stat
