read_verilog -sv rtl/M03/src/M03_DRAMController.sv
hierarchy -check -top M03_DRAMController
synth -top M03_DRAMController -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M03_DRAMController_20260518_220045.v
stat
