read_verilog -sv rtl/M04/src/M04_SystemBus.sv
hierarchy -check -top M04_SystemBus
synth -top M04_SystemBus -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M04_SystemBus_20260518_220045.v
stat
