read_verilog -sv rtl/M06/src/M06_ClockManager.sv
hierarchy -check -top M06_ClockManager
synth -top M06_ClockManager -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M06_ClockManager_20260518_220045.v
stat
