read_verilog -sv rtl/M07/src/M07_ResetManager.sv
hierarchy -check -top M07_ResetManager
synth -top M07_ResetManager -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M07_ResetManager_20260518_220045.v
stat
