read_verilog -sv rtl/M08/src/M08_ThreadScheduler.sv
hierarchy -check -top M08_ThreadScheduler
synth -top M08_ThreadScheduler -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M08_ThreadScheduler_20260518_220045.v
stat
