read_verilog -sv rtl/M09/src/M09_AttentionUnit.sv
hierarchy -check -top M09_AttentionUnit
synth -top M09_AttentionUnit -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M09_AttentionUnit_20260518_220045.v
stat
