read_verilog -sv rtl/M10/src/M10_FFNMatMul.sv
hierarchy -check -top M10_FFNMatMul
synth -top M10_FFNMatMul -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M10_FFNMatMul_20260518_220045.v
stat
