read_verilog -sv rtl/M11/src/M11_RMSNormRoPE.sv
hierarchy -check -top M11_RMSNormRoPE
synth -top M11_RMSNormRoPE -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M11_RMSNormRoPE_20260518_220045.v
stat
