read_verilog -sv rtl/M13/src/M13_ISADecoder.sv
hierarchy -check -top M13_ISADecoder
synth -top M13_ISADecoder -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M13_ISADecoder_20260518_220045.v
stat
