read_verilog -sv rtl/M14/src/M14_SecureBoot.sv
hierarchy -check -top M14_SecureBoot
synth -top M14_SecureBoot -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M14_SecureBoot_20260518_220045.v
stat
