read_verilog -sv rtl/M15/src/M15_JTAGInterface.sv
hierarchy -check -top M15_JTAGInterface
synth -top M15_JTAGInterface -flatten
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules_simple/M15_JTAGInterface_20260518_220045.v
stat
