read_verilog -sv rtl/M14/src/M14_SecureBoot.sv
hierarchy -check -top M14_SecureBoot
synth -top M14_SecureBoot -flatten
opt_clean -purge
stat
