read_verilog -sv rtl/M15/src/M15_JTAGInterface.sv
hierarchy -check -top M15_JTAGInterface
synth -top M15_JTAGInterface -flatten
opt_clean -purge
stat
