read_verilog -sv rtl/M03/src/M03_DRAMController.sv
hierarchy -check -top M03_DRAMController
synth -top M03_DRAMController
opt
opt_clean -purge
abc -liberty /home/lxx/wrk/libs/asap7_reference_design/lib/asap7sc7p5t_AO_LVT_TT_nldm_211120.lib -g AND,OR,NAND,NOR,XOR
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules/M03_DRAMController_20260518_205803.v
stat -liberty /home/lxx/wrk/libs/asap7_reference_design/lib/asap7sc7p5t_AO_LVT_TT_nldm_211120.lib
