read_verilog -sv rtl/M07/src/M07_ResetManager.sv
hierarchy -check -top M07_ResetManager
synth -top M07_ResetManager
opt
opt_clean -purge
abc -liberty /home/lxx/wrk/libs/asap7_reference_design/lib/asap7sc7p5t_AO_LVT_TT_nldm_211120.lib -g AND,OR,NAND,NOR,XOR
opt_clean -purge
write_verilog -noattr rtl/designs/NPU_top/synth/modules/M07_ResetManager_20260518_205803.v
stat -liberty /home/lxx/wrk/libs/asap7_reference_design/lib/asap7sc7p5t_AO_LVT_TT_nldm_211120.lib
